MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K50/mcu.h
extern volatile __bit                   BRG8                __at(0x7D80);	// @ (0xFB0 * 8 + 0)
#define                                 BRG8_bit            _BIT_ACCESS(SPBRGH1,0)
// SPBRGH1<BRG9>
extern volatile __bit                   BRG9                __at(0x7D81);	// @ (0xFB0 * 8 + 1)
#define                                 BRG9_bit            _BIT_ACCESS(SPBRGH1,1)
// TXSTA1<BRGH>
extern volatile __bit                   BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA1,2)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// UEIE<BTOEE>
extern volatile __bit                   BTOEE               __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 BTOEE_bit           _BIT_ACCESS(UEIE,4)
// UEIR<BTOEF>
extern volatile __bit                   BTOEF               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 BTOEF_bit           _BIT_ACCESS(UEIR,4)
// UEIE<BTSEE>
extern volatile __bit                   BTSEE               __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 BTSEE_bit           _BIT_ACCESS(UEIE,7)
// UEIR<BTSEF>
extern volatile __bit                   BTSEF               __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 BTSEF_bit           _BIT_ACCESS(UEIR,7)
// CM1CON0<C1CH0>
extern volatile __bit                   C1CH0               __at(0x7CC0);	// @ (0xF98 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1CH1>
extern volatile __bit                   C1CH1               __at(0x7CC1);	// @ (0xF98 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON0,1)
// CM2CON1<C1HYS>
extern volatile __bit                   C1HYS               __at(0x7CD3);	// @ (0xF9A * 8 + 3)
#define                                 C1HYS_bit           _BIT_ACCESS(CM2CON1,3)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<C1IP>
extern volatile __bit                   C1IP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 C1IP_bit            _BIT_ACCESS(IPR2,6)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x7CC5);	// @ (0xF98 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x7CC7);	// @ (0xF98 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x7CC6);	// @ (0xF98 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x7CC4);	// @ (0xF98 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1R>
extern volatile __bit                   C1R                 __at(0x7CC2);	// @ (0xF98 * 8 + 2)
#define                                 C1R_bit             _BIT_ACCESS(CM1CON0,2)
// CM2CON1<C1RSEL>
extern volatile __bit                   C1RSEL              __at(0x7CD5);	// @ (0xF9A * 8 + 5)
#define                                 C1RSEL_bit          _BIT_ACCESS(CM2CON1,5)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x7CC3);	// @ (0xF98 * 8 + 3)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,3)
// CM2CON1<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x7CD1);	// @ (0xF9A * 8 + 1)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM2CON1,1)
// CCPTMRS<C1TSEL>
extern volatile __bit                   C1TSEL              __at(0x7AC8);	// @ (0xF59 * 8 + 0)
#define                                 C1TSEL_bit          _BIT_ACCESS(CCPTMRS,0)
// CM2CON0<C2CH0>
extern volatile __bit                   C2CH0               __at(0x7CC8);	// @ (0xF99 * 8 + 0)
#define                                 C2CH0_bit           _BIT_ACCESS(CM2CON0,0)
// CM2CON0<C2CH1>
extern volatile __bit                   C2CH1               __at(0x7CC9);	// @ (0xF99 * 8 + 1)
#define                                 C2CH1_bit           _BIT_ACCESS(CM2CON0,1)
// CM2CON1<C2HYS>
extern volatile __bit                   C2HYS               __at(0x7CD2);	// @ (0xF9A * 8 + 2)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON1,2)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,5)
// IPR2<C2IP>
extern volatile __bit                   C2IP                __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 C2IP_bit            _BIT_ACCESS(IPR2,5)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x7CCD);	// @ (0xF99 * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x7CCF);	// @ (0xF99 * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7CCE);	// @ (0xF99 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x7CCC);	// @ (0xF99 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2R>
extern volatile __bit                   C2R                 __at(0x7CCA);	// @ (0xF99 * 8 + 2)
#define                                 C2R_bit             _BIT_ACCESS(CM2CON0,2)
// CM2CON1<C2RSEL>
extern volatile __bit                   C2RSEL              __at(0x7CD4);	// @ (0xF9A * 8 + 4)
#define                                 C2RSEL_bit          _BIT_ACCESS(CM2CON1,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x7CCB);	// @ (0xF99 * 8 + 3)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,3)
// CM2CON1<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x7CD0);	// @ (0xF9A * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON1,0)
// CCPTMRS<C2TSEL>
extern volatile __bit                   C2TSEL              __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 C2TSEL_bit          _BIT_ACCESS(CCPTMRS,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// ECCP1AS<CCP1ASE>
extern volatile __bit                   CCP1ASE             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 CCP1ASE_bit         _BIT_ACCESS(ECCP1AS,7)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PMD1<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD1,0)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7CB8);	// @ (0xF97 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7CB9);	// @ (0xF97 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7CBA);	// @ (0xF97 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PMD1<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD1,1)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7CBD);	// @ (0xF97 * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7CBC);	// @ (0xF97 * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK>
extern volatile __bit                   CK                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK_bit              _BIT_ACCESS(PORTC,6)
// PORTE<CK1SPP>
extern volatile __bit                   CK1SPP              __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 CK1SPP_bit          _BIT_ACCESS(PORTE,0)
// PORTE<CK2SPP>
extern volatile __bit                   CK2SPP              __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 CK2SPP_bit          _BIT_ACCESS(PORTE,1)
// SSP1STAT<CKE>
extern volatile __bit                   CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP1CON1<CKP>
extern volatile __bit                   CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PIE2<CM1IE>
extern volatile __bit                   CM1IE               __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE2,6)
// PIR2<CM1IF>
extern volatile __bit                   CM1IF               __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR2,6)
// IPR2<CM1IP>
extern volatile __bit                   CM1IP               __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CM1IP_bit           _BIT_ACCESS(IPR2,6)
// PIE2<CM2IE>
extern volatile __bit                   CM2IE               __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE2,5)
// PIR2<CM2IF>
extern volatile __bit                   CM2IF               __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR2,5)
// IPR2<CM2IP>
extern volatile __bit                   CM2IP               __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 CM2IP_bit           _BIT_ACCESS(IPR2,5)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PMD1<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD1,3)
// PMD1<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x7BFC);	// @ (0xF7F * 8 + 4)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD1,4)
// CM1CON0<COUT1>
extern volatile __bit                   COUT1               __at(0x7CC6);	// @ (0xF98 * 8 + 6)
#define                                 COUT1_bit           _BIT_ACCESS(CM1CON0,6)
// CM2CON0<COUT2>
extern volatile __bit                   COUT2               __at(0x7CCE);	// @ (0xF99 * 8 + 6)
#define                                 COUT2_bit           _BIT_ACCESS(CM2CON0,6)
// UEIE<CRC16EE>
extern volatile __bit                   CRC16EE             __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 CRC16EE_bit         _BIT_ACCESS(UEIE,2)
// UEIR<CRC16EF>
extern volatile __bit                   CRC16EF             __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 CRC16EF_bit         _BIT_ACCESS(UEIR,2)
// UEIE<CRC5EE>
extern volatile __bit                   CRC5EE              __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 CRC5EE_bit          _BIT_ACCESS(UEIE,1)
// UEIR<CRC5EF>
extern volatile __bit                   CRC5EF              __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 CRC5EF_bit          _BIT_ACCESS(UEIR,1)
// RCSTA1<CREN>
extern volatile __bit                   CREN                __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA1,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// TXSTA1<CSRC>
extern volatile __bit                   CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA1,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,3)
// PMD1<CTMUMD>
extern volatile __bit                   CTMUMD              __at(0x7BFD);	// @ (0xF7F * 8 + 5)
#define                                 CTMUMD_bit          _BIT_ACCESS(PMD1,5)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7C7D);	// @ (0xF8F * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7C78);	// @ (0xF8F * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// VREFCON1<DACEN>
extern volatile __bit                   DACEN               __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(VREFCON1,7)
// VREFCON1<DACLPS>
extern volatile __bit                   DACLPS              __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 DACLPS_bit          _BIT_ACCESS(VREFCON1,6)
// VREFCON1<DACNSS>
extern volatile __bit                   DACNSS              __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 DACNSS_bit          _BIT_ACCESS(VREFCON1,0)
// VREFCON1<DACOE>
extern volatile __bit                   DACOE               __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(VREFCON1,5)
// VREFCON1<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(VREFCON1,2)
// VREFCON1<DACPSS1>
extern volatile __bit                   DACPSS1             __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 DACPSS1_bit         _BIT_ACCESS(VREFCON1,3)
// VREFCON2<DACR0>
extern volatile __bit                   DACR0               __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(VREFCON2,0)
// VREFCON2<DACR1>
extern volatile __bit                   DACR1               __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(VREFCON2,1)
// VREFCON2<DACR2>
extern volatile __bit                   DACR2               __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(VREFCON2,2)
// VREFCON2<DACR3>
extern volatile __bit                   DACR3               __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(VREFCON2,3)
// VREFCON2<DACR4>
extern volatile __bit                   DACR4               __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(VREFCON2,4)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7CBC);	// @ (0xF97 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7CBD);	// @ (0xF97 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// UEIE<DFN8EE>
extern volatile __bit                   DFN8EE              __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 DFN8EE_bit          _BIT_ACCESS(UEIE,3)
// UEIR<DFN8EF>
extern volatile __bit                   DFN8EF              __at(0x7B3B);	// @ (0xF67 * 8 + 3)
